// int num = new Random().Next(10, 100);

// Console.WriteLine($"Было сгенерировано число: {num}");
// int x1 = num / 10;
// int x2 = num % 10;
// if(x1 > x2)
//     Console.WriteLine($"Наибольшая цифра это {x1}");
// else if(x2 > x1)
//     Console.WriteLine($"Наибольшая цифра это {x2}");
// else
//     Console.WriteLine("Они равны");

// for(int i = 0; i < new Random().Next(10, 100); i++)
// {
//     Console.Write($"{i} ");
// }


// Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.

// 456 -> 46
// 782 -> 72
// 918 -> 98


// Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если число 2 не кратно числу 1, 
// то программа выводит остаток от деления.

// 34, 5 -> не кратно, остаток 4 
// 16, 4 -> кратно

// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 
// 7 и 23.

// 14 -> нет 
// 46 -> нет 
// 161 -> да

// Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

// 5, 25  ->  да
// -4, 16  ->  да
// 25, 5  ->  да
// 8,9  ->  нет

